**Missing Data**

In [2]:
import numpy as np
import pandas as pd

In [ ]:
np.nan          #nan --> not a number

nan

In [ ]:
pd.NA           #is pandasâ€™ universal missing value indicator.

In [ ]:
pd.NaT          #NaT means Not a Time.

NaT

This is generally because the logic here is, since we don't know these values, we can't know if they are equal to each other.

In [7]:
np.nan == np.nan

False

In [8]:
np.nan in [np.nan]

True

In [9]:
np.nan is np.nan

True

In [10]:
pd.NA == pd.NA

**Data**

In [11]:
df = pd.read_csv('movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [12]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [13]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [14]:
df['last_name']

0      Hanks
1        NaN
2    Jackman
3    Winfrey
4      Stone
Name: last_name, dtype: object

In [15]:
df[df['last_name'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [ ]:
#'pre_movie_score' must be null and 'sex' must have value
df[(df['pre_movie_score'].isnull()) & df['sex'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

**Drop Data**

In [19]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [ ]:
# It will drop the null values containing row (atleast 1 null value)
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [ ]:
#threshold means the minimum number of non-missing (non-NA) values required to keep a row or column
df.dropna(thresh=1)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [ ]:
#Drop any column that has at least ONE missing value
df.dropna(axis=1)

# Output shows only indexes Beacause every column as atleast one null value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [25]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [ ]:
df.dropna(thresh=4,axis=1)
#pre_movie_score and post_movie_score are removed

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

**Fill Data**

In [ ]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [ ]:
df.fillna("NEW VALUE!")

#IT will fills the Null values by the "NEW VALUE"

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63.0,m,8.0,10.0
1,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!
2,Hugh,Jackman,51.0,m,NEW VALUE!,NEW VALUE!
3,Oprah,Winfrey,66.0,f,6.0,8.0
4,Emma,Stone,31.0,f,7.0,9.0

In [29]:
df['first_name'].fillna("EMPTY")

0      Tom
1    EMPTY
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [30]:
df['pre_movie_score'].mean()

np.float64(7.0)

In [34]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [32]:
df['pre_movie_score']=df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

In [35]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              7.0               NaN
2       Hugh   Jackman  51.0    m              7.0               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

**FILLING WITH INTERPOLATION**

In [37]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [38]:
ser = pd.Series(airline_tix)

In [39]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [ ]:
#ser.interpolate() fills missing values (NaN / NA) in a Series by estimating values between known data points
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

In [42]:
ser = ser.copy()
ser.index = range(len(ser))   # numeric index

In [ ]:
ser.interpolate(method='spline', order=2)
#Have to install 'scipy' module
#output:-
#first           100.0
#business         75.0
#economy-plus     50.0
#economy          30.0

ImportError: Missing optional dependency 'scipy'. spline interpolation requires SciPy. Use pip or conda to install scipy.

In [45]:
df = pd.DataFrame(ser,columns=['Price'])

In [46]:
df

   Price
0  100.0
1    NaN
2   50.0
3   30.0

In [47]:
df.interpolate()

   Price
0  100.0
1   75.0
2   50.0
3   30.0

In [49]:
df=df.reset_index

In [50]:
df.interpolate(method='spline',order=2)

AttributeError: 'function' object has no attribute 'interpolate'